{
  "backend/main.mo": "Main Motoko actor implementing employee attendance tracking with role-based access control, storing employees, user profiles, and attendance records with check-in/check-out functionality and admin management.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: useIsAdmin hook verification and admin UI component display for a specific principal ID.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including hooks, components, pages, and utilities for the attendance tracking application with offline support and admin features.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining light and dark mode theme variables for the Simotech brand.",
  "frontend/index.html": "HTML entry point for the Simotech Renewable Attendance App with root div and module script reference.",
  "frontend/src/App.tsx": "Main React application with TanStack Router setup, authentication flow, role-based routing (employee/admin), profile setup modal, and offline indicator integration.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Access denied page component displaying a shield alert icon and message for users attempting to access admin-only routes.",
  "frontend/src/components/AdminLoginInfo.tsx": "Informational card component explaining how users can request admin access by emailing their Principal ID to the system administrator.",
  "frontend/src/components/AttendanceActions.tsx": "Card component with check-in and check-out buttons that capture geolocation, display current attendance status, and handle loading/error states.",
  "frontend/src/components/AttendanceReportTable.tsx": "Displays attendance records in a table format with date, check-in/out times, hours worked, and location. Calculates and shows total hours worked across all records.",
  "frontend/src/components/EmployeeListCard.tsx": "Renders a card displaying employee information including name, email, check-in status badge, and admin indicator.",
  "frontend/src/components/Layout.tsx": "Main layout component with header navigation, logo, and responsive mobile menu. Shows different navigation links based on authentication and admin status.",
  "frontend/src/components/LocationDisplay.tsx": "Displays GPS coordinates with a location icon and creates a clickable Google Maps link for the coordinates.",
  "frontend/src/components/LoginButton.tsx": "Handles Internet Identity authentication with login/logout functionality and loading states. Clears query cache on logout.",
  "frontend/src/components/MonthYearSelector.tsx": "Provides dropdown selectors for choosing a month and year, showing the current year and 4 previous years.",
  "frontend/src/components/OfflineIndicator.tsx": "Shows fixed-position alerts for offline status, syncing progress, and sync success with pending record counts.",
  "frontend/src/components/PrincipalDisplay.tsx": "Displays the user's Principal ID in a card with copy-to-clipboard functionality and instructions for requesting admin access.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time users to enter their name and email to complete profile setup. Cannot be dismissed until completed.",
  "frontend/src/components/RecentAttendanceList.tsx": "Shows the 10 most recent attendance records for the current month with check-in/out times, hours worked, and location details.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and initializing access control with an admin token from URL parameters.",
  "frontend/src/hooks/useCheckIn.ts": "Provides a mutation hook for checking in with geolocation coordinates, queuing the action offline if the actor is unavailable and invalidating relevant queries on success.",
  "frontend/src/hooks/useCheckOut.ts": "Provides a mutation hook for checking out, queuing the action offline if the actor is unavailable and invalidating relevant queries on success.",
  "frontend/src/hooks/useCurrentAttendanceStatus.ts": "Queries the current user's attendance status by fetching today's records from the monthly report and determining if they are currently checked in, refetching every 30 seconds.",
  "frontend/src/hooks/useGeolocation.ts": "Provides a hook to get the user's current geolocation using the browser's Geolocation API with high accuracy, handling loading states and permission errors.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Queries the current user's profile from the backend actor, waiting for the actor to be available before fetching.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useIsAdmin.ts": "Queries whether the current user has admin privileges from the backend, with detailed console logging for debugging.",
  "frontend/src/hooks/useOfflineSync.ts": "Monitors online/offline status and automatically syncs queued check-in/check-out actions when connectivity is restored, tracking pending items and last sync time.",
  "frontend/src/hooks/useQueries.ts": "Provides multiple query and mutation hooks for user profiles, admin checks, employee lists, and attendance reports, consolidating backend data access patterns.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for a professional green and orange corporate theme supporting both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that displays employee list, attendance overview, and navigation to reports. Includes access control checks and redirects non-admin users to an access denied screen.",
  "frontend/src/pages/EmployeeDashboard.tsx": "Employee dashboard page showing user profile, current check-in status, attendance actions, and recent attendance history. Redirects unauthenticated users to home.",
  "frontend/src/pages/MonthlyReportPage.tsx": "Admin-only page for viewing monthly attendance reports with filters for employee selection, year, and month. Displays detailed attendance records in a table format.",
  "frontend/src/utils/offlineQueue.ts": "Utility for managing offline attendance queue in localStorage, allowing check-in/check-out actions to be stored when offline and synced later.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, extended shadows, animations, and container settings for the application's design system.",
  "project_state.json": "Project metadata tracking implemented features, architectural decisions, and a known issue where admin features don't display for a specific principal ID despite authorization."
}