{
  "backend/main.mo": "Main Motoko actor implementing employee attendance system with role-based access control, user profiles, check-in/out functionality, attendance records, and admin operations including employee management and reporting with extensive debug logging.",
  "feature_evidence.json": "Feature evidence report documenting three logging features added to useIsAdmin hook, AdminDashboard component, and Layout component for debugging admin authorization flow.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components, hooks, pages, and utilities for the Simotech attendance application with React, TanStack Router, and offline support.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining light and dark mode theme variables for the Simotech brand including primary, secondary, accent, and sidebar colors.",
  "frontend/index.html": "HTML entry point for the Simotech Renewable Attendance App with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with routes for employee/admin dashboards, monthly reports, and access denied pages, plus authentication flow with profile setup modal and offline indicator.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Component displaying access denied message with shield icon and link back to dashboard when non-admin users attempt to access restricted pages.",
  "frontend/src/components/AdminLoginInfo.tsx": "Dismissible card component explaining how to request admin access by logging in with Internet Identity, copying principal ID, and emailing it to the system administrator.",
  "frontend/src/components/AttendanceActions.tsx": "Provides check-in and check-out buttons with geolocation integration, displays current attendance status, and shows loading/error states during attendance operations.",
  "frontend/src/components/AttendanceReportTable.tsx": "Displays a table of attendance records with check-in/out times, hours worked, and locations, including total hours calculation for the selected period.",
  "frontend/src/components/EmployeeListCard.tsx": "Renders an employee card showing name, email, admin status badge, and optional check-in/out status indicator.",
  "frontend/src/components/Layout.tsx": "Main layout component with header, navigation (desktop and mobile), and conditional rendering of admin/employee links based on authentication and role status with extensive debug logging.",
  "frontend/src/components/LocationDisplay.tsx": "Displays geographic coordinates as a clickable link to Google Maps with a location icon.",
  "frontend/src/components/LoginButton.tsx": "Handles Internet Identity authentication with login/logout functionality and loading states, clearing query cache on logout.",
  "frontend/src/components/MonthYearSelector.tsx": "Provides dropdown selectors for choosing month and year, generating the last 5 years as options.",
  "frontend/src/components/OfflineIndicator.tsx": "Shows fixed-position alerts for offline status, syncing progress, and sync success with auto-hide functionality.",
  "frontend/src/components/PrincipalDisplay.tsx": "Displays the user's Internet Identity principal ID with copy-to-clipboard functionality and instructions for requesting admin access.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog component for initial user profile setup, collecting name and email with form validation and submission via useSaveCallerUserProfile hook.",
  "frontend/src/components/RecentAttendanceList.tsx": "Displays a card list of the user's recent attendance records for the current month, showing check-in/out times, hours worked, and location data.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication, initializing access control and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useCheckIn.ts": "Mutation hook for checking in with geolocation coordinates, queuing the action offline if the backend call fails.",
  "frontend/src/hooks/useCheckOut.ts": "Mutation hook for checking out, queuing the action offline if the backend call fails.",
  "frontend/src/hooks/useCurrentAttendanceStatus.ts": "Query hook that fetches today's attendance records to determine if the user is currently checked in and returns the last record.",
  "frontend/src/hooks/useGeolocation.ts": "Hook that wraps the browser's Geolocation API to get current position with high accuracy, handling errors and loading states.",
  "frontend/src/hooks/useGetCallerUserProfile.ts": "Query hook that fetches the current user's profile from the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and delegation validity.",
  "frontend/src/hooks/useIsAdmin.ts": "Query hook that checks if the current user has admin privileges by calling the backend's isAdmin method, with extensive debug logging.",
  "frontend/src/hooks/useOfflineSync.ts": "Custom React hook that manages offline queue synchronization for attendance check-in/check-out actions, monitoring online/offline status and automatically syncing pending operations when connectivity is restored.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, employee data, attendance records, and admin status using the Internet Computer actor backend.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a professional green and orange corporate color theme for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/AdminDashboard.tsx": "Admin dashboard page that displays employee list and management features, with extensive debug logging and access control that redirects non-admin users.",
  "frontend/src/pages/EmployeeDashboard.tsx": "Employee dashboard page showing user profile, current attendance status, check-in/check-out actions, and recent attendance history.",
  "frontend/src/pages/MonthlyReportPage.tsx": "Admin-only page for viewing monthly attendance reports with employee selection and month/year filtering, includes access control and debug logging.",
  "frontend/src/utils/offlineQueue.ts": "Utility functions for managing a localStorage-based queue of attendance actions (check-in/check-out) that occur while offline.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence and cleanup capabilities.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, container settings, border radius variables, custom shadows, and animations for accordions and fades.",
  "project_state.json": "Project metadata describing an offline-first employee attendance app with Internet Identity authentication, geolocation tracking, monthly reporting, and admin features; currently has an issue with admin privileges not displaying for a specific principal ID."
}